{
	"html": "<h1>КОНУС</h1><p>Конусом (точнее, круговым конусом) называется тело, которое состоит из круга — основания конуса, точки, не лежащей в плоскости этого круга, — вершины конуса и всех отрезков, соединяющих вершину конуса с точками основания</p><p>Отрезки, соединяющие вершину конуса с точками окружности основания, называются образующими, конуса. Поверхность конуса состоит из основания и боковой поверхности.</p><p>Конус называется прямым, если прямая, соединяющая вершину конуса с центром основания, перпендикулярна плоскости основания. В дальнейшем мы будем рассматривать только прямой конус, называя его для краткости просто конусом. Наглядно прямой круговой конус можно представлять себе как тело, полученное при вращении прямоугольного треугольника вокруг его катета как оси.</p><p>Высотой конуса называется перпендикуляр, опущенный из его вершины на плоскость основания. У прямого конуса основание высоты совпадает с центром основания. Осью прямого кругового конуса называется прямая, содержащая его высоту.</p><p>Cвойства конуса:</p><ol><li>Все образующие конуса равны</li><li>Углы наклона образующих к основанию равны</li><li>Углы между осью и образующими равны</li><li>Углы между осью и основанием прямые.</li></ol><p>Плоскость, которая параллельна основанию конуса и которая пересекает конус, отсекает от него конус меньшего размера. Оставшаяся часть является усеченным конусом.</p><p>Пирамида, вписанная в конус, это пирамида, у которой основание является многоугольником, вписанным в окружность основания конуса, а его вершина - это вершина конуса. Боковые ребра пирамиды, которая вписана в конус, становятся образующими конуса.</p><p>Касательная плоскость к конусу - это плоскость, которая проходит через образующую конуса и которая перпендикулярна плоскости осевого сечения, содержащей эту образующую.</p><p>Пирамида, описанная около конуса это пирамида, у которой основанием является многоугольник, который описан около основания конуса, а вершина совпадает с вершиной конуса. Плоскости боковых граней описанной пирамиды - это касательные плоскости конуса.</p><p>Пусть H — высота конуса, S1-площадь боковой поверхности конуса, S2— полная площадь поверхности конуса(сумма площадей основания и боковой поверхности), V - объем кругового конуса, R- радиус основания конуса, S- площадь боковой поверхности конуса, l- длина образующей, А- угол раствора конуса, В- телесный угол при вершине вершине прямого кругового конуса, R1 и R2- радиусы оснований усеченного конуса.</p>",
	"calculators": [{
			"input": ["R", "l"],
			"formula": "$$S = {R*l*\\pi}$$",
			"js": "function(obj){return obj.R*obj.l*Math.PI;}"
		},
		{
			"input": ["R1", "R2", "l"],
			"formula": "$$S_1 = {l*(R_1+R_2)}$$",
			"js": "function(obj){return obj.l*(obj.R1+obj.R2);}"
		},
		{
			"input": ["R", "l"],
			"formula": "$$S_2 = {\\pi*R*(R+l)}$$",
			"js": "function(obj){return Math.PI*obj.R*(obj.R+obj.l);}"
		},
		{
			"input": ["R", "H"],
			"formula": "$$V = {1/3*\\pi*R^2*H}$$",
			"js": "function(obj){return 1/3*Math.PI*obj.R*obj.R*obj.H;}"
		},
		{
			"input": ["A"],
			"formula": "$$B = {2*\\pi*(1-\\cos{A/2})}$$",
			"js": "function(obj){return 2*Math.PI*(1-Math.cos(obj.A/2));}"
		}
	]
}
